<span style="font-family:MV Boli; font-weight:Bold; font-size:2.3em; color:#00b3e5;"> Pandas
    
    - Meaning: Panel Data
    - Data Structures:
      - Single-Dimensional: Series Object
      - Multi-Dimensional: Data Frame

In [1]:
import pandas as pd

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:2.3em; color:#00b3e5;"> Series Object

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Creating Series

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> from list

In [2]:
s = pd.Series([ 1, 2, 3, 4, 5 ])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s = pd.Series( [ 1, 2, 3, 4, 5 ],
               index = [ 'a', 'b', 'c', 'd', 'e' ]
             )
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> from dictionary

In [4]:
pd.Series(  {'a':10, 'b':20, 'c':30}  )

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(  {'a':10, 'b':20, 'c':30},
            index=['b','c','d','a'] )

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Accessing Data

In [6]:
s = pd.Series([0,10,20,30,40,50,60,70,80,90])
s

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> first n

In [7]:
s[:3]

0     0
1    10
2    20
dtype: int64

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> last n

In [8]:
s[-3:]

7    70
8    80
9    90
dtype: int64

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Math

In [9]:
S1 = pd.Series([0, 1, 2, 3, 4, 5])
S2 = pd.Series([0,10,20,30,40,50])

5*S1 + S2/2 + 100

0    100.0
1    110.0
2    120.0
3    130.0
4    140.0
5    150.0
dtype: float64

In [10]:
S1 = pd.Series(['A', 'B', 'C', 'D', 'E', 'F'])
S2 = pd.Series(['0','10','20','30','40','50'])

S1 + '_' + S2

0     A_0
1    B_10
2    C_20
3    D_30
4    E_40
5    F_50
dtype: object

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:2.3em; color:#00b3e5;"> Data Frame

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Creating Data Frame

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> from dictionary

In [11]:
df = pd.DataFrame( { "Name"  : ['Bob', 'Sam', 'Anne', 'Rose', 'Lily'],
                     "Marks" : [  76 ,   25 ,    92 ,   100 ,   100 ], 
                     "Month" : ['May', 'Oct',  'Jan',  'Aug',  'Aug'], 
                     "Height": [ 192 ,  187 ,   165 ,   172 ,   172,], }
                 )
df

   Name  Marks Month  Height
0   Bob     76   May     192
1   Sam     25   Oct     187
2  Anne     92   Jan     165
3  Rose    100   Aug     172
4  Lily    100   Aug     172

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> from list

In [12]:
df = pd.DataFrame( data = [ ['Bob' ,   76  , 'May' ,  192   ], 
                            ['Sam' ,   25  , 'Oct' ,  187   ], 
                            ['Anne',   92  , 'Jan' ,  165   ],
                            ['Rose',  100  , 'Aug' ,  172   ],
                            ['Lily',  100  , 'Aug' ,  172   ],
                          ], 
                columns =   ['Name','Marks','Month','Height'],
                 )
df

   Name  Marks Month  Height
0   Bob     76   May     192
1   Sam     25   Oct     187
2  Anne     92   Jan     165
3  Rose    100   Aug     172
4  Lily    100   Aug     172

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Dropping

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> indexes

In [13]:
df.drop([0,2,4],axis=0)

   Name  Marks Month  Height
1   Sam     25   Oct     187
3  Rose    100   Aug     172

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> features

In [14]:
df.drop(['Name','Height'],axis=1)

   Marks Month
0     76   May
1     25   Oct
2     92   Jan
3    100   Aug
4    100   Aug

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Viewing

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> rows

In [15]:
df[ df['Month']=="Aug" ]

   Name  Marks Month  Height
3  Rose    100   Aug     172
4  Lily    100   Aug     172

In [16]:
df.loc[ df['Month']=="Aug" , : ]

   Name  Marks Month  Height
3  Rose    100   Aug     172
4  Lily    100   Aug     172

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> cols

In [17]:
df.loc[ : , ['Month','Marks'] ]

  Month  Marks
0   May     76
1   Oct     25
2   Jan     92
3   Aug    100
4   Aug    100

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Statistics

In [18]:
df.describe().T

        count   mean        std    min    25%    50%    75%    max
Marks     5.0   78.6  31.524594   25.0   76.0   92.0  100.0  100.0
Height    5.0  177.6  11.371016  165.0  172.0  172.0  187.0  192.0

In [19]:
df.count()

Name      5
Marks     5
Month     5
Height    5
dtype: int64

In [20]:
df[ ['Marks','Height'] ].mean()

Marks      78.6
Height    177.6
dtype: float64

In [21]:
df[ ['Marks','Height'] ].median()

Marks      92.0
Height    172.0
dtype: float64

In [22]:
df[ ['Marks','Height'] ].mode()

   Marks  Height
0    100     172

In [23]:
df[ ['Marks','Height'] ].std()

Marks     31.524594
Height    11.371016
dtype: float64

In [24]:
df[ ['Marks','Height'] ].min()

Marks      25
Height    165
dtype: int64

In [25]:
df[ ['Marks','Height'] ].max()

Marks     100
Height    192
dtype: int64

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Applying Functions

In [26]:
def Doubler(x):
    return x*2
df[ ['Marks','Height'] ].apply( Doubler )

   Marks  Height
0    152     384
1     50     374
2    184     330
3    200     344
4    200     344

In [40]:
def Create_Bucket( x ):
    if    0<=x and x<70: return 'F'
    elif 70<=x and x<80: return 'C'
    elif 80<=x and x<90: return 'B'
    else               : return 'A'
    
new = df[['Name','Marks']].copy()
new['Bucket'] = new['Marks'].apply( Create_Bucket )
new

   Name  Marks Bucket
0   Bob     76      C
1   Sam     25      F
2  Anne     92      A
3  Rose    100      A
4  Lily    100      A

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> SubCat Count

In [28]:
pd.crosstab( df['Month'], columns='Subcat_Count' )

col_0  Subcat_Count
Month
Aug               2
Jan               1
May               1
Oct               1

In [29]:
df['Month'].value_counts()

Month
Aug    2
May    1
Oct    1
Jan    1
Name: count, dtype: int64

In [30]:
df.groupby('Month').size()

Month
Aug    2
Jan    1
May    1
Oct    1
dtype: int64

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Sorting

In [31]:
df.sort_values( ['Month','Marks'], ascending=[False,True] )

   Name  Marks Month  Height
1   Sam     25   Oct     187
0   Bob     76   May     192
2  Anne     92   Jan     165
3  Rose    100   Aug     172
4  Lily    100   Aug     172

#

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.8em; color:#00b3e5;"> Combining

In [32]:
df1 = pd.DataFrame({ 'emp_id'  : ['101','102','103','104'],
                     'dept'    : ['content','content','sales','tech'],
                     'gender'  : ['m','f','m','m'],
                     'salary'  : [12000,15000,18000,16000],
                   }, index    = [0,1,2,3]
                   )
df2 = pd.DataFrame({ 'emp_id'  : ['101','103','104','105'],
                     'location': ['New York','Boston','Boston','New Jersey'],
                     'distance': [16,17,44,21],
                     'salary'  : [12000,18000,16000,17000],
                   }, index    = [0,1,2,3]
                   )

<span style="font-family:Arial; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> concat

In [33]:
pd.concat([df1,df2],axis=0,sort=False)

  emp_id     dept gender  salary    location  distance
0    101  content      m   12000         NaN       NaN
1    102  content      f   15000         NaN       NaN
2    103    sales      m   18000         NaN       NaN
3    104     tech      m   16000         NaN       NaN
0    101      NaN    NaN   12000    New York      16.0
1    103      NaN    NaN   18000      Boston      17.0
2    104      NaN    NaN   16000      Boston      44.0
3    105      NaN    NaN   17000  New Jersey      21.0

<span style="font-family:MV Boli; font-weight:Bold; font-size:1.5em; color:#00b3e5;"> merge

In [34]:
pd.merge( df1, df2, how='inner', on='emp_id' )

  emp_id     dept gender  salary_x  location  distance  salary_y
0    101  content      m     12000  New York        16     12000
1    103    sales      m     18000    Boston        17     18000
2    104     tech      m     16000    Boston        44     16000

In [35]:
pd.merge( df1, df2, how='left', on='emp_id' )

  emp_id     dept gender  salary_x  location  distance  salary_y
0    101  content      m     12000  New York      16.0   12000.0
1    102  content      f     15000       NaN       NaN       NaN
2    103    sales      m     18000    Boston      17.0   18000.0
3    104     tech      m     16000    Boston      44.0   16000.0

In [36]:
pd.merge( df1, df2, how='right', on='emp_id' )

  emp_id     dept gender  salary_x    location  distance  salary_y
0    101  content      m   12000.0    New York        16     12000
1    103    sales      m   18000.0      Boston        17     18000
2    104     tech      m   16000.0      Boston        44     16000
3    105      NaN    NaN       NaN  New Jersey        21     17000

In [37]:
pd.merge( df1, df2, how='outer', on='emp_id' )

  emp_id     dept gender  salary_x    location  distance  salary_y
0    101  content      m   12000.0    New York      16.0   12000.0
1    102  content      f   15000.0         NaN       NaN       NaN
2    103    sales      m   18000.0      Boston      17.0   18000.0
3    104     tech      m   16000.0      Boston      44.0   16000.0
4    105      NaN    NaN       NaN  New Jersey      21.0   17000.0

#####

#####